---
kind: type
id: T:Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs
source: html/2af49738-a0c3-0e9b-f344-0f39d15dbd49.htm
---
# Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs

The event arguments used by the FabricationPartBrowserChangedEventArgs event.

## Syntax (C#)
```csharp
public class FabricationPartBrowserChangedEventArgs : RevitAPISingleEventArgs
```